const ArabicWords = [
  'أباظة',
  'أبجدي',
  'أبحاث',
  'أبخرة',
  'أبدية',
  'أبراج',
  'أبرهة',
  'أبريل',
  'أبزاخ',
  'أبطال',
  'أبعاد',
  'أبقار',
  'أبكار',
  'أبناء',
  'أبنية',
  'أبواب',
  'أبولو',
  'أفعال',
  'أبوية',
  'أبيات',
  'أتاري',
  'أتباع',
  'أتراك',
  'أتمتة',
  'أثرية',
  'أثقال',
  'أثمان',
  'أثناء',
  'أجانب',
  'أجبان',
  'أجداد',
  'أجزاء',
  'أجساد',
  'أجسام',
  'أجمية',
  'أجناد',
  'أجناس',
  'أجنبي',
  'أجنحة',
  'أجندة',
  'أجنيس',
  'أجهزة',
  'أجواء',
  'أجوبة',
  'أجياد',
  'أجيال',
  'أحادي',
  'أحباء',
  'أحباب',
  'أحبار',
  'أحجار',
  'أحجام',
  'أحجية',
  'أحداث',
  'أحذية',
  'أحرار',
  'أحراش',
  'أحزاب',
  'أحزان',
  'أحزمة',
  'أحسنت',
  'أحشاء',
  'أحصنة',
  'أحضان',
  'أحفاد',
  'أحقية',
  'أحكام',
  'أحلام',
  'أحماض',
  'أحمال',
  'أحمدي',
  'أحناف',
  'أحواز',
  'أحواش',
  'أحواض',
  'أحوال',
  'أحياء',
  'أحيان',
  'أخبار',
  'أختام',
  'أخشاب',
  'أخطاء',
  'أخطار',
  'أخلاق',
  'أخماس',
  'أخميم',
  'أخوات',
  'أخيرا',
  'أدراج',
  'أدرار',
  'أدعية',
  'أدغال',
  'أدمغة',
  'أدوات',
  'أدوار',
  'أدوية',
  'أديان',
  'أديبا',
  'أديبة',
  'أديرة',
  'أذواق',
  'أراضى',
  'أرانب',
  'أرباح',
  'أرباع',
  'أربطة',
  'أربعة',
  'أربية',
  'أربيل',
  'أرجاء',
  'أرجان',
  'أرشفة',
  'أرشيف',
  'أرصاد',
  'أرصدة',
  'أرصفة',
  'أرطال',
  'أرقام',
  'أركان',
  'أرملة',
  'أرواح',
  'أرواد',
  'أروبا',
  'أروقة',
  'أرياف',
  'أريان',
  'أريكة',
  'أزدية',
  'أزلية',
  'أزمات',
  'أزمنة',
  'أزمير',
  'أزهار',
  'أزهري',
  'أزواج',
  'أزواد',
  'أزياء',
  'أسئلة',
  'أساسا',
  'أسبوع',
  'أستاذ',
  'أسراب',
  'أسرار',
  'أسطول',
  'أسعار',
  'أسفار',
  'أسفله',
  'أسلاف',
  'أسلاك',
  'أسلام',
  'أسلحة',
  'أسلمة',
  'أسلوب',
  'أسلية',
  'أسماء',
  'أسماك',
  'أسمدة',
  'أسنان',
  'أسوار',
  'أسواق',
  'أسوان',
  'أسياد',
  'أسيرة',
  'أشباح',
  'أشبال',
  'أشباه',
  'أشجار',
  'أشخاص',
  'أشرار',
  'أشراف',
  'أشرطة',
  'أشرعة',
  'أشغال',
  'أشقاء',
  'أشكال',
  'أشلاء',
  'أشواط',
  'أشواك',
  'أشياء',
  'أصالة',
  'أصباغ',
  'أصحاب',
  'أصداء',
  'أصدار',
  'أصداف',
  'أصقاع',
  'أصلاب',
  'أصلية',
  'أصناف',
  'أصوات',
  'أصيلة',
  'أضرار',
  'أضرحة',
  'أضعاف',
  'أضلاع',
  'أضواء',
  'أطباء',
  'أطباق',
  'أطراف',
  'أطعمة',
  'أطفال',
  'أطلال',
  'أطماع',
  'أطنان',
  'أطوار',
  'أطوال',
  'أطياف',
  'أظافر',
  'أعالي',
  'أعباء',
  'أعتاب',
  'أعراض',
  'أعراف',
  'أعراق',
  'أعزاز',
  'أعشاب',
  'أعشاش',
  'أعصاب',
  'أعضاء',
  'أعطال',
  'أعلاف',
  'أعمار',
  'أعماق',
  'أعمال',
  'أعمام',
  'أعمدة',
  'أعناق',
  'أعواد',
  'أعوام',
  'أعوان',
  'أعياد',
  'أعيان',
  'أغانى',
  'أغذية',
  'أغراض',
  'أغسطس',
  'أغصان',
  'أغطية',
  'أغلبه',
  'أغلفة',
  'أغنام',
  'أغنية',
  'أفاضل',
  'أفاعي',
  'أفخاذ',
  'أفراح',
  'أفراد',
  'أفراس',
  'أفرام',
  'أفران',
  'أفغان',
  'أفكار',
  'أفلاك',
  'أفلام',
  'أفنان',
  'أفندى',
  'أفواج',
  'أفواه',
  'أفيال',
  'أقارب',
  'أقاصي',
  'أقباط',
  'أقداد',
  'أقران',
  'أقزام',
  'أقساط',
  'أقسام',
  'أقضية',
  'أقطاب',
  'أقطار',
  'أقفال',
  'أقلام',
  'أقلية',
  'أقمار',
  'أقمشة',
  'أقنعة',
  'أقواس',
  'أقوال',
  'أقوام',
  'أكابر',
  'أكسيد',
  'أكشاك',
  'أكلات',
  'أكمام',
  'أكواب',
  'أكواخ',
  'أكواد',
  'أكوام',
  'أكياس',
  'ألبان',
  'ألبسة',
  'ألبوم',
  'ألسنة',
  'ألغاز',
  'ألغام',
  'ألفاظ',
  'ألفية',
  'ألفين',
  'ألواح',
  'ألوان',
  'ألوية',
  'أليفة',
  'أمارة',
  'أماكن',
  'أمالي',
  'أمانة',
  'أمتار',
  'أمتعة',
  'أمثال',
  'أمثلة',
  'أمجاد',
  'أمسية',
  'أمطار',
  'أمعاء',
  'أمراض',
  'ألماس',
  'ألمان',
  'أملاح',
  'أملاك',
  'أمهات',
  'أموات',
  'أمواج',
  'أموال',
  'أمورا',
  'أميال',
  'أميرة',
  'أنحاء',
  'أنسجة',
  'أنصار',
  'أنصاف',
  'أنظمة',
  'أنعام',
  'أنغام',
  'أنفاس',
  'أنفية',
  'أنقاض',
  'أنمار',
  'أنماط',
  'أنهار',
  'أنوار',
  'أنواع',
  'أنوال',
  'أنوية',
  'أنياب',
  'أهالى',
  'أهداب',
  'أهداف',
  'أهراس',
  'أهرام',
  'أهوار',
  'أهوال',
  'أوائل',
  'أواخر',
  'أواسط',
  'أواصر',
  'أوامر',
  'أوبئة',
  'أوبرا',
  'أوجاع',
  'أوجان',
  'أودية',
  'أوراق',
  'أورام',
  'أوردة',
  'أوزان',
  'أوساط',
  'أوسان',
  'أوسمة',
  'أوصاف',
  'أوضاع',
  'أوعية',
  'أوقات',
  'أوقاف',
  'أوقية',
  'أولاد',
  'أوهام',
  'أيتام',
  'أيلول',
  'أڤتار',
  'بادية',
  'بارجة',
  'بارزة',
  'بارعا',
  'بارعة',
  'بارود',
  'بازار',
  'باطلة',
  'باكرة',
  'بائسة',
  'بائعة',
  'بالسل',
  'باهرة',
  'باهظة',
  'بايعه',
  'ببغاء',
  'بخارى',
  'بحيرة',
  'بدائل',
  'بدائى',
  'بداية',
  'بذيئة',
  'برامج',
  'برغوث',
  'بركان',
  'برمجة',
  'برلين',
  'برميل',
  'برهان',
  'بريمة',
  'بساطة',
  'بسائل',
  'بسالة',
  'بستان',
  'بسيطة',
  'بشائر',
  'بشارة',
  'بشاعة',
  'بصلية',
  'بصمات',
  'بضائع',
  'بضاعة',
  'بطاطا',
  'بطاطس',
  'بطاقة',
  'بطالة',
  'بطانة',
  'بطلات',
  'بقالة',
  'بقايا',
  'بقشيش',
  'بكارة',
  'بكرات',
  'بلاغة',
  'بلوتو',
  'بواخر',
  'بوادر',
  'بوذية',
  'بورصة',
  'بوليس',
  'بيادق',
  'بيئية',
  'بيضاء',
  'بيطرى',
  'بيوتا',
  'ابداع',
  'اتباع',
  'اتجاه',
  'اتساق',
  'اتصال',
  'اتهام',
  'تأثير',
  'تلويح',
  'تأجيج',
  'تأبين',
  'تأجير',
  'تأجيل',
  'تأخير',
  'تأدية',
  'تأرجح',
  'تأصيل',
  'تأقلم',
  'تأليف',
  'تألقت',
  'تأميم',
  'تأمين',
  'تأنيث',
  'تأويل',
  'تأييد',
  'تابعة',
  'تأثير',
  'تاجرا',
  'تاركة',
  'تاریخ',
  'تأسيس',
  'تافهة',
  'تأكيد',
  'تالية',
  'تأليف',
  'تبادل',
  'تباعد',
  'تباطؤ',
  'تباعا',
  'تبخير',
  'تبديل',
  'تبرئة',
  'تبصرة',
  'تبعات',
  'تبليط',
  'تبييض',
  'تجاذب',
  'تجارب',
  'تجارة',
  'تجاهل',
  'تجاوز',
  'تجديف',
  'تجربة',
  'تجريد',
  'تجريم',
  'تجزئة',
  'تجسيد',
  'تجفيف',
  'تجليد',
  'تجميد',
  'تجميع',
  'تجميل',
  'تجهيز',
  'تجويد',
  'تجويف',
  'تحذير',
  'تحرير',
  'تحريض',
  'تحريك',
  'تحريم',
  'تحسبا',
  'تحصيل',
  'تحصين',
  'تحضير',
  'تحفيز',
  'تحفيظ',
  'تحطيم',
  'تحقيق',
  'تحليق',
  'تحليل',
  'تحميل',
  'تحنيط',
  'تحوير',
  'تحويل',
  'تخاطب',
  'تخاطر',
  'تخدير',
  'تخريب',
  'تخريج',
  'تخزين',
  'تخصصا',
  'تخصيب',
  'تخصيص',
  'تخطيط',
  'تخفيض',
  'تخفيف',
  'تخلخل',
  'تخليد',
  'تخليص',
  'تخليق',
  'تخميس',
  'تخمين',
  'تخويف',
  'تداخل',
  'تدارك',
  'تداعي',
  'تدافع',
  'تدجين',
  'تدخين',
  'تدريب',
  'تدريج',
  'تدقيق',
  'تدليس',
  'تدليك',
  'تدهور',
  'تدوير',
  'تدويل',
  'تدوين',
  'تذبذب',
  'تذاكر',
  'تهوين',
  'تذييل',
  'تذكير',
  'تراجع',
  'تراجم',
  'تراسل',
  'تراوح',
  'تربية',
  'تربيع',
  'ترجمة',
  'ترتيل',
  'ترحيب',
  'ترجيح',
  'ترحيل',
  'ترخيص',
  'ترسيب',
  'ترسيخ',
  'ترسيم',
  'ترشيد',
  'ترشيح',
  'ترطيب',
  'ترعرع',
  'ترفيه',
  'ترقية',
  'ترقيم',
  'تكوين',
  'تركية',
  'تركيز',
  'ترميم',
  'تروية',
  'ترويج',
  'ترويض',
  'ترياق',
  'تزاوج',
  'تزايد',
  'تزكية',
  'تزويد',
  'تزوير',
  'تزييف',
  'تزيين',
  'تساؤل',
  'تسابق',
  'تسارع',
  'تساقط',
  'تساند',
  'تساهم',
  'تسجيل',
  'تسريب',
  'تسريح',
  'تسريع',
  'تسعير',
  'تسعين',
  'تسكين',
  'تسلسل',
  'تسلية',
  'تسليح',
  'تسليط',
  'تسليم',
  'تسمية',
  'تسميم',
  'تسهيل',
  'تسوية',
  'تسويق',
  'تسيير',
  'تشاؤم',
  'تشابك',
  'تشابل',
  'تشابه',
  'تشاجر',
  'تشاور',
  'تشتيت',
  'تشجيع',
  'تشخيص',
  'تشديد',
  'ترشيح',
  'تشريح',
  'تشريد',
  'تشريع',
  'تشريف',
  'تشغيل',
  'تشفير',
  'تشكيك',
  'تشكيل',
  'تشهير',
  'تشويق',
  'تشويش',
  'تشويه',
  'تشييد',
  'تشييع',
  'تصادف',
  'تصادق',
  'تصادم',
  'تصارع',
  'تصاعد',
  'تصالح',
  'تصحيح',
  'تصديق',
  'تصريف',
  'تصريح',
  'تصعيد',
  'تصغير',
  'تصفية',
  'تصفيف',
  'تصفيق',
  'تصليح',
  'تصميم',
  'تصنيع',
  'تصنيف',
  'تصويب',
  'تصوير',
  'تضاؤل',
  'تضاعف',
  'تضامن',
  'تضحية',
  'تضخيم',
  'تضليل',
  'تضمين',
  'تضييع',
  'تضييق',
  'تطابق',
  'تطاول',
  'تطبيع',
  'تطبيق',
  'تطعيم',
  'تطهير',
  'تطوير',
  'تطويع',
  'تطويق',
  'تطويل',
  'تعارض',
  'تعاطف',
  'تعاطى',
  'تعاظم',
  'تعافى',
  'تعبئة',
  'تعايش',
  'تعبيد',
  'تعبير',
  'تعديل',
  'تعدين',
  'تعذيب',
  'تعريب',
  'تعريف',
  'تعزية',
  'تعزيز',
  'تعطيل',
  'تعقيب',
  'تعقيد',
  'تعقيم',
  'تعليب',
  'تعليم',
  'تعمير',
  'تعميق',
  'تعميم',
  'تعويض',
  'تعويم',
  'تعيين',
  'تغذية',
  'تغطية',
  'تغلغل',
  'تغليف',
  'تغمغم',
  'تغيير',
  'تفاؤل',
  'تفادى',
  'تفارق',
  'تفاضل',
  'تفاعل',
  'تفاقم',
  'تفاهم',
  'تفاوت',
  'تفاوض',
  'تفتيش',
  'تفجير',
  'تفخيم',
  'تفرقة',
  'تفريق',
  'تفسير',
  'تفصيل',
  'تفضيل',
  'تفعيل',
  'تفكير',
  'تفليس',
  'تنفيذ',
  'تقابل',
  'تقارب',
  'تقاطع',
  'تقاعد',
  'تقبيل',
  'تقسيم',
  'تقسیم',
  'تقصير',
  'تقطيع',
  'تقليد',
  'تقليل',
  'تقليص',
  'تقليم',
  'تقنية',
  'تقهقر',
  'تقوية',
  'تقويم',
  'تقويض',
  'تقييد',
  'تقييم',
  'تكافؤ',
  'تكتيك',
  'تكذيب',
  'تكرار',
  'تكرير',
  'تكريم',
  'تكسير',
  'تكفير',
  'تكلفة',
  'تكليف',
  'تكميم',
  'تكوين',
  'تكييف',
  'تلائم',
  'تلاشى',
  'تلاوة',
  'تلبيس',
  'تلطيف',
  'تلفاز',
  'تلقيح',
  'تلقين',
  'تلميح',
  'تلميذ',
  'تلوين',
  'تماثل',
  'تمازج',
  'تماسك',
  'تمايز',
  'تمايل',
  'تمجيد',
  'تمثال',
  'تمجيد',
  'تمثيل',
  'تمديد',
  'تمريض',
  'تمساح',
  'تمشيط',
  'تمكين',
  'تمهيد',
  'تمويل',
  'تموين',
  'تمويه',
  'تمييز',
  'تنازع',
  'تنازل',
  'تناسخ',
  'تناسق',
  'تناظر',
  'تناغن',
  'تنافر',
  'تنافس',
  'تناقص',
  'تنافض',
  'تناقل',
  'تنامى',
  'تناوب',
  'تناول',
  'تنبيه',
  'تنحية',
  'تنزيل',
  'تناسب',
  'تنسيق',
  'تنشئة',
  'تنشيط',
  'تنصيب',
  'تنصير',
  'تنظيف',
  'تنظير',
  'تنظيم',
  'تنفيس',
  'تنقيط',
  'تنمية',
  'تنويع',
  'تنويم',
  'تنوين',
  'تنويه',
  'تهامة',
  'تهجئة',
  'تهجير',
  'تهجين',
  'تهدئة',
  'تهديد',
  'تهديم',
  'تهذيب',
  'تهريب',
  'تهميش',
  'تهنئة',
  'تهوية',
  'تهويد',
  'تهيئة',
  'تهيمن',
  'توأمة',
  'توائم',
  'توابع',
  'تاوجد',
  'تواجه',
  'توارث',
  'توازن',
  'توازى',
  'تواصل',
  'تواضع',
  'تواطؤ',
  'توافد',
  'توافر',
  'توافق',
  'توثيق',
  'توجيه',
  'توراة',
  'توريث',
  'توريد',
  'توريد',
  'توريط',
  'توزيع',
  'توسعة',
  'توسيع',
  'توصية',
  'توصيف',
  'توصيل',
  'توضيح',
  'توطين',
  'توطيد',
  'توظيف',
  'توعية',
  'توفيق',
  'توقيع',
  'توكيد',
  'توقيف',
  'توكيل',
  'تولية',
  'تيسير',
  'ثائرة',
  'ثابتة',
  'ثاقبة',
  'ثالثة',
  'ثالوث',
  'ثامنة',
  'ثانوي',
  'ثرثار',
  'ثرثرة',
  'ثعبان',
  'ثغرات',
  'ثقافى',
  'ثقافة',
  'ثقالة',
  'ثقيلا',
  'ثقيلة',
  'ثلاثة',
  'ثلاثى',
  'ثلاجة',
  'ثلجية',
  'ثمانى',
  'ثمينة',
  'ثنائى',
  'ثنوية',
  'ثوانى',
  'ثلجية',
  'ثوبان',
  'ثورات',
  'ثورية',
  'جائحة',
'جائرة',
'جائزة',
'جاذبة',
'جارحة',
'جارفة',
'جارور',
'جارية',
'جاسوس',
'جالسة',
'جامدة',
'جامعة',
'جاموس',
'جانبا',
'جاهدة',
'جاهلي',
'جبارة',
'جبالة',
'جبانة',
'جباية',
'جبرية',
'جبريل',
'جبلية',
'جبلين',
'جبيرة',
'جثمان',
'جحافل',
'جدارة',
'جداول',
'جدعان',
'جدعون',
'جدولة',
'جديدة',
'جديرة',
'جذابة',
'جذرية',
'جذعية',
'جذيمة',
'جرائد',
'جرائم',
'جراحة',
'جرادة',
'جرارة',
'جرافة',
'جرجير',
'جرداء',
'جرذان',
'جرمان',
'جريئة',
'جريحا',
'جريدة',
'جريمة',
'جزءان',
'جزءين',
'جزئيا',
'جزئية',
'جزرية',
'جزيئة',
'جزيرة',
'جسارة',
'جسدية',
'جسمان',
'جفافا',
'جلاجل',
'جلباب',
'جلدية',
'جلطات',
'جمادى',
'جماجم',
'جمارك',
'جماعة',
'جمالا',
'جماعي',
'جمباز',
'جمبري',
'جمجمة',
'جمعاء',
'جمعان',
'جمعية',
'جمهور',
'جميعا',
'جميلة',
'جنائي',
'جنادة',
'جنازة',
'جناية',
'جنبات',
'جنرال',
'جهالة',
'جوائز',
'جهينة',
'جوارب',
'جوالة',
'جوامع',
'جوانب',
'جوفاء',
'جوفية',
'جولات',
'جوهرة',
'جيبية'
]

const DictLength = ArabicWords.length
function Alerting(msg)
{
  let AlertBox = document.getElementById("alerting")
  AlertBox.style.visibility="visible"
  AlertBox.innerHTML = msg
  setTimeout(()=>{
   AlertBox.style.visibility="hidden"
  },2000)

}


function TimeLeft()
{
  let timer = document.getElementById("timer");
  const Intervalfunction = setInterval(Countdown, 1000);
  
  function Countdown()
  {

  let CurenTime = new Date();
  let  EndTime = new Date(CurenTime.getFullYear(),CurenTime.getMonth(), CurenTime.getDay()+1); 
  const diff = (EndTime-CurenTime)/1000/60/60
  const hours   =  diff-24
  const secondsleft = diff * 3600
  const minutes = (hours- Math.floor(hours)) * 60
  const seconds = (minutes-Math.floor(minutes))*60
  timer.innerHTML = `0${Math.trunc(hours)}:${Math.trunc(minutes)}:${Math.trunc(seconds)}`;
  if (secondsleft==0)
  {
    clearInterval(Intervalfunction)
  }

}



}
function Check()
{

  // let StartedDate = new Date("2022-02-4")
  // let date = new Date()
  // let CurrentTime = new Date()
  // let diff = Math.abs(StartedDate - CurrentTime)
  // let dayscount = Math.ceil(diff/ (1000 * 60 * 60 * 24))
}




function SearchDict(word)
{
  for (let i=0; i<DictLength; i++)
  {
    if (ArabicWords[i]==word)
      return true
  }
  return false
}

function ShowPanel(state)
{
  
  if (state=="WINNER")
  {

    document.getElementById("status").innerHTML = "أحسنت"
  }
  else
  {
    document.getElementById("status").innerHTML = "حاول المرة القادمة"
  }
  setTimeout(()=>{
    document.querySelector(".panel").style.display = "block"
    document.querySelector(".GameBoard").style.opacity = "60%"
    document.querySelector(".title").style.opacity = "60%"
  },1000)
}



document.addEventListener("DOMContentLoaded",()=>
{


if (localStorage.userwords === undefined )
{

  let initial_evaluations =[[],[],[],[],[],[]]
  for (let row =0; row<6; row++)
  {
    for (let column=0; column<5; column++)
    {
      initial_evaluations[row][column] = null
    }
  }

  localStorage.setItem('evaluations',JSON.stringify(initial_evaluations))
  localStorage.setItem('userwords',JSON.stringify([]))
  localStorage.setItem('playscount',0)
  localStorage.setItem('gamestatus',"playing")
  localStorage.setItem('row',0)
}

else
{
 
  let status = localStorage.getItem("gamestatus")
  if (status !=="playing")
  {
      Check()
      TimeLeft()  
      ShowPanel(status)
  }


  let  TypedWords  = JSON.parse(localStorage.getItem('userwords'));
  let  Evaluations = JSON.parse(localStorage.getItem('evaluations'));
  for (let row =0; row < TypedWords.length; row++)
  {
    let Row = document.querySelector(`.row${row}`).getElementsByTagName("input")
    let letter = 0
    for (let column =4; column>=0; column--)
    {
      Row[column].value = TypedWords[row][letter]
      Row[column].style.backgroundColor = Evaluations[row][letter]
      letter++
    }
  }
 
}
// closing panel
document.querySelector("i").addEventListener("click",()=>{
  document.querySelector(".GameBoard").style.opacity = "100%"
  document.querySelector(".title").style.opacity = "100%"
  document.querySelector(".panel").style.display = "none"

})

  const WordForToday = ArabicWords[80]
  let RowWord = []
  let current_row =  Number(localStorage.row) ;
  let current_position = 0;
  let  AraicOnlyPattern=/^[\u0621-\u064A]+$/

  document.addEventListener("keypress",e=>{
    if (current_position <=4   && current_row <=5 && localStorage.gamestatus =="playing")
    {
 
      let CurrentLetter =  document.getElementById(`row${current_row}_letter${current_position}`); 
      if(AraicOnlyPattern.test(e.key))
      {
        if (CurrentLetter.value =="")
        {
          RowWord.push(e.key)
          CurrentLetter.value= e.key
          CurrentLetter.style.borderColor = "white";
        }
          current_position++;
      }
  }

 })


document.addEventListener("keydown",e=>{

  if(e.key=="Backspace" && current_position >0  && localStorage.gamestatus =="playing")
  {
    current_position--;  
    let CurrentLetter = document.getElementById(`row${current_row}_letter${current_position}`);
    CurrentLetter.value="";
    CurrentLetter.style.borderColor = "#434343"
    RowWord.pop()
  }


  
  // checking the user's word after pressing Enter key
  if (e.key=="Enter" && current_position===5 && current_row <=5   && localStorage.gamestatus =="playing")
  {

    const RowWordString =RowWord.join('')
    let ValidWord = [...WordForToday]
    
    const CurrentRowLetters = Object.values(document.querySelector(`.row${current_row}`).getElementsByTagName("input")).reverse()  

    if (SearchDict(RowWordString))
    {
      
      let current_evaluations = JSON.parse(localStorage.getItem('evaluations'));
      let correct_letters =0      
      current_position=0;

      for (let i =0;i<5;i++)
      {
        CurrentRowLetters[i].style.borderColor = "#434343"
        if (RowWord[i] == ValidWord[i])
          {
            CurrentRowLetters[i].style.backgroundColor= "green"
            current_evaluations[current_row][i] = "green"
            RowWord[i] = "-"
            ValidWord[i] ="_"
            correct_letters++
          }
      }

      
        if (correct_letters==5 || current_row==5)
        {    
          
          localStorage.playscount = Number(localStorage.playscount) + 1;
        
          if (correct_letters==5)
          {
            localStorage.setItem("gamestatus","WINNER")
            ShowPanel("WINNER")
          }
          else
          {
            localStorage.setItem("gamestatus","LOSER")
           ShowPanel("LOSER")
          }
          TimeLeft()
     
        }
         
            OuterLoop:
            for(let i = 0;i<5;i++)
            {
              if (RowWord[i] =="-")
              continue
              
              for(let j = 0;j<5;j++)
              {
                  if (RowWord[i]==ValidWord[j])
                  {
                    CurrentRowLetters[i].style.backgroundColor = "#C9B558"
                    current_evaluations[current_row][i] = "#C9B558"
                    ValidWord[j] = "_"
                    continue OuterLoop
                  }
              }
              CurrentRowLetters[i].style.backgroundColor = "#3A3A3C"
              current_evaluations[current_row][i] = "#3A3A3C"
            }

        
        
        RowWord=[]
        ValidWord = []
        current_row ++;
        localStorage.row = Number(localStorage.row) + 1;
        let userwords = JSON.parse(localStorage.getItem('userwords'));
        console.log(RowWordString)
        userwords.push(RowWordString);
        localStorage.setItem('userwords', JSON.stringify(userwords));
        localStorage.setItem('evaluations', JSON.stringify(current_evaluations));
    }
    else
    {
      Alerting("كلمة خاطئة")
    }
  
  
  }


})




})
